In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
data1=pd.read_csv("Project-assignmenttable1.csv")
data1

            date      country  total_revenue
0     2007-04-08       Malawi           0.99
1     2007-04-10      Estonia           5.98
2     2007-03-18      Germany          17.94
3     2007-04-11      Estonia           2.99
4     2007-04-08     Anguilla           0.99
...          ...          ...            ...
2470  2007-03-02    Kazakstan           8.98
2471  2007-02-18      Ukraine           8.99
2472  2007-03-18      Senegal           4.99
2473  2007-04-28  South Korea          25.95
2474  2007-03-18  Puerto Rico           6.98

[2475 rows x 3 columns]

In [4]:
data1.sort_values('date', inplace=True)

In [5]:
countries = ['Canada', 'France', 'India']

In [6]:
filtered_data = data1[data1['country'].isin(countries)]

In [7]:
time_series = filtered_data.groupby(['date', 'country'])['total_revenue'].sum()

In [8]:
time_series = time_series.reset_index()

In [9]:
pivot_data1 = time_series.pivot(index='date', columns='country', values='total_revenue')

In [1]:
pivot_data1.plot()
plt.xlabel('date')
plt.ylabel('total_revenue')
plt.title('Time Series by Country')
plt.xticks(rotation=45)
plt.show()

NameError: name 'pivot_data1' is not defined